# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import pandas as pd
import sqlite3

conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [3]:
#Your code here
c.execute("""SELECT firstName, lastName FROM employees 
                JOIN offices USING(officeCode)
                WHERE city IS 'Boston'""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [4]:
#Your code here
c.execute("""SELECT COUNT(employeeNumber) FROM offices
                LEFT JOIN employees USING(officeCode)
                GROUP BY officeCode""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   COUNT(employeeNumber)
0                      6
1                      2
2                      2
3                      5
4                      2
5                      4
6                      2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# 1. how many customers does each office serve?

In [40]:
# Your code here
c.execute("""SELECT officeCode, o.city, COUNT(customerNumber) as customers FROM offices o
                JOIN employees e USING(officeCode)
                JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                GROUP BY officeCode""")

df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  officeCode           city  customers
0          1  San Francisco         12
1          2         Boston         12
2          3            NYC         15
3          4          Paris         29
4          5          Tokyo          5
5          6         Sydney         10
6          7         London         17

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [1]:
# Your code here
# join employees with customers, orders, orderdetails, and products
c.execute("""SELECT e.firstName, e.lastName, p.productName, COUNT(p.productCode) FROM employees e
                JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o ON c.customerNumber = o.customerNumber
                JOIN orderdetails od ON o.orderNumber = od.orderNumber
                JOIN products p ON od.productCode = p.productCode
                GROUP BY p.productCode""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

NameError: name 'c' is not defined

## Level Up: Display the Number of Products each employee has sold

In [61]:
#Your code here
c.execute("""SELECT e.firstName, e.lastName, COUNT(p.productCode) as productsSold FROM employees e
                JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o ON c.customerNumber = o.customerNumber
                JOIN orderdetails od ON o.orderNumber = od.orderNumber
                JOIN products p ON od.productCode = p.productCode
                GROUP BY employeeNumber""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   firstName   lastName  productsSold
0     Leslie   Jennings           331
1     Leslie   Thompson           114
2      Julie   Firrelli           124
3      Steve  Patterson           152
4   Foon Yue      Tseng           142
5     George     Vanauf           211
6       Loui     Bondur           177
7     Gerard  Hernandez           396
8     Pamela   Castillo           272
9      Larry       Bott           236
10     Barry      Jones           220
11      Andy     Fixter           185
12     Peter      Marsh           185
13      Mami      Nishi           137
14    Martin     Gerard           114

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!